" ======================================================== "
"                          Editor                          "
" ======================================================== "


" ----------------------------------------------------------
" Row number
" 行號
" ----------------------------------------------------------
set number
set relativenumber


" ----------------------------------------------------------
" Folding
" 折疊
" ----------------------------------------------------------
" Notes:
"   folding 是為了讓程式更有可讀性、更簡潔，因此同一區塊的內
"   容折疊成一行。
"
"   foldenable:     啟用折疊
"   foldmethod:     指定自動折疊模式。
"   foldcolumn:     在左側增加頁邊以顯示折疊情況。
"   foldlevelstart: 設定從多少層後才開始折疊。
"   foldnestmax:    設定最多巢狀折疊多少層。
"
"   適當設定 foldlevelstart 與 foldnestmax 可避免折疊太多、
"   太細，反而降低易讀性。
" ----------------------------------------------------------
set foldenable
set foldmethod=syntax
set foldcolumn=1
set foldlevelstart=10
set foldnestmax=10



" ----------------------------------------------------------
" Wrap
" 折行
" ----------------------------------------------------------
" Notes:
"
"   nowrap:    當內容超過終端機寬度，不要折行顯示，而是就讓
"              他超出終端機顯示範圍。
"
"   linebreak: 讓自動折行不折在單字中間，以避免破壞單字，
"              降低易讀性。
" ----------------------------------------------------------
set nowrap
set linebreak



" ======================================================== "
"                          Cursor                          "
" ======================================================== "


" ----------------------------------------------------------
" Show Crosshair
" 顯示十字準心
" ----------------------------------------------------------
set cursorline
set cursorcolumn


" ----------------------------------------------------------
" Virtual Mode, 使游標可以移到實際上沒有字元的位置
" ----------------------------------------------------------
set virtualedit=all


" ----------------------------------------------------------
" Minimal number of screen lines to keep above and below the
" cursor.
" 在捲動頁面時，保留幾行的高度
" ----------------------------------------------------------
set scrolloff=7


" ----------------------------------------------------------
" Let scroll to left or right more smooth
" 當沒有折行，而要左右捲動頁面時，一次捲動幾行
" （數字越小越平滑）
" ----------------------------------------------------------
set sidescroll=1



" ======================================================== "
"                       Command Line                       "
" ======================================================== "


" ----------------------------------------------------------
" Set CommandLine position
" 設定命令列位置
" ----------------------------------------------------------
set cmdheight=1


" ----------------------------------------------------------
" Show current command
" 顯示當前按下的指令
" ----------------------------------------------------------
set showcmd


" ----------------------------------------------------------
" Show Current Mode ,eg. INSERT, INSERT(paste)
" 顯示當前模式
" ----------------------------------------------------------
set showmode


" ----------------------------------------------------------
" Show Position
" 顯示游標座標
" ----------------------------------------------------------
set ruler


" ----------------------------------------------------------
" Turn on the Wild menu
" ----------------------------------------------------------
set wildmenu



" ======================================================== "
"                        Status Line                       "
" ======================================================== "


" ----------------------------------------------------------
" 顯示狀態列
" ----------------------------------------------------------
set laststatus=2


" ----------------------------------------------------------
" Set statusline content
" 設定狀態列內容
" ----------------------------------------------------------
function! SyntaxItem()
  return synIDattr(synID(line("."),col("."),1),"name")
endfunction

if has('statusline')
  set statusline=%2n\                              " buffer number
  set statusline+=%<                               " Truncate here if winwidth is too small (filename too long)
  set statusline+=%f\                              " file name
  set statusline+=%m                               " modified flag
  set statusline+=%r                               " read only flag
  set statusline+=[%{strlen(&fenc)?&fenc:'none'},\ " file encoding
  set statusline+=%{&ff}]                          " file format
  set statusline+=%y                               " filetype
  set statusline+=%=                               " left/right separator
  set statusline+=\ %{SyntaxItem()}\               " syntax highlight group under cursor
  set statusline+=0x%B\                            " character code under cursor
  set statusline+=%l/%L,\ %c%V\ %P                 " cursor position/offset
endif



" ======================================================== "
"                         Tab Line                         "
" ======================================================== "


" ----------------------------------------------------------
" Always show tab line
" ----------------------------------------------------------
set showtabline=2


