" ======================================================== "
"                        Searching                         "
" ======================================================== "


" ---------------------------------------------------------
" Highlight the matches while searching
" ---------------------------------------------------------
set hlsearch
set incsearch
set ignorecase

" ---------------------------------------------------------
" Override the 'ignorecase' option if the search pattern
" contains upper case characters.
" 若搜尋字串中包含大寫，則取消 ignorecase 的效果
" ---------------------------------------------------------
" Note:
" 對於 "*", "#", "gd" 的搜尋中無效，但可以在搜尋一次後按下
" "/<CR>" ，如此可以自動取得上一次的搜尋字串並開始一般的搜
" 尋。
" ---------------------------------------------------------
set smartcase

" ---------------------------------------------------------
" Changes the special characters that can be used in search
" patterns.
" 讓搜尋字串可以用許多 regexp 的特殊字元
" ---------------------------------------------------------
set magic

" ---------------------------------------------------------
" Shortcut for turn off highlighted search result.
" ---------------------------------------------------------
nnoremap <leader><space> :nohlsearch<CR>
